#+STARTUP: indent
* yasnippet
  #+BEGIN_SRC emacs-lisp
    (use-package yasnippet
      :defer 2
      :init
      (setq yas-snippet-dirs
            '("~/.emacs.d/snippets"
              ))
      :config
      (yas-global-mode 1)
      (define-key yas-minor-mode-map [(tab)] nil)
      (define-key yas-minor-mode-map (kbd "TAB") nil)
      (define-key yas-minor-mode-map (kbd "C-c y y") 'yas-expand-from-trigger-key)
      (define-key yas-minor-mode-map (kbd "C-c y n") 'yas-new-snippet))
    (use-package yasnippet-snippets
      :defer 2
      :after yasnippet)
  #+END_SRC

  #+RESULTS:
  : [nil 0 2 0 nil require (yasnippet-snippets nil t) idle 0]

* org-mode
  #+BEGIN_VERSE
  see discribe-variable org-catch-invisible-edits
  #+END_VERSE
  #+BEGIN_SRC emacs-lisp
    (setq org-catch-invisible-edits 'error)

    (org-babel-do-load-languages
     'org-babel-load-languages
     '(
       (shell . t)
       (ditaa . t)
       (python . t)
       (js . t)
       )
     )

    (setq org-enforce-todo-dependencies t)

    (setq org-todo-keywords
          '((sequence "TODO(t)" "|" "DONE(d!)")
            (sequence "BUG(b)" "WAITING(w!/@)" "|" "FIXED(f!)" "DELAY(D!)")))

    (setq org-tag-alist '(("开发" . ?d) ("第三方" . ?t) ("同步数据" . ?s)))

    (defun org-summary-todo (n-done n-not-done)
      "Switch entry to DONE when all subentries are done, to TODO otherwise."
      (let (org-log-done org-log-states)   ; turn off logging
        (org-todo (if (= n-not-done 0) "DONE" "TODO"))))

    (add-hook 'org-after-todo-statistics-hook 'org-summary-todo)

    (setq org-babel-python-command "python3.7")
  #+END_SRC

  #+RESULTS:
  : python3.7

* treemacs
#+BEGIN_SRC emacs-lisp
  (use-package treemacs
    :ensure t
    :defer t
    :init
    (with-eval-after-load 'winum
      (define-key winum-keymap (kbd "M-0") #'treemacs-select-window))
    :config
    (progn
      (if (display-graphic-p)
          (progn
            (setq treemacs-no-png-images nil)
            (message "set treemacs-no-png-images t"))
        (progn
          (setq treemacs-no-png-images t)
          (message "set treemacs-no-png-images nil")
          )
        )
      (setq treemacs-collapse-dirs                 (if treemacs-python-executable 3 0)
            treemacs-deferred-git-apply-delay      0.5
            treemacs-directory-name-transformer    #'identity
            treemacs-display-in-side-window        t
            treemacs-eldoc-display                 t
            treemacs-file-event-delay              1000
            ;; treemacs-file-extension-regex          treemacs-last-period-regex-value
            treemacs-file-follow-delay             0.2
            treemacs-file-name-transformer         #'identity
            treemacs-follow-after-init             t
            treemacs-git-command-pipe              ""
            treemacs-goto-tag-strategy             'refetch-index
            treemacs-indentation                   2
            treemacs-indentation-string            " "
            treemacs-is-never-other-window         nil
            treemacs-max-git-entries               5000
            treemacs-missing-project-action        'ask
            treemacs-no-delete-other-windows       t
            treemacs-project-follow-cleanup        nil
            treemacs-persist-file                  (expand-file-name ".cache/treemacs-persist.org" user-emacs-directory)
            treemacs-position                      'left
            treemacs-recenter-distance             0.1
            treemacs-recenter-after-file-follow    nil
            treemacs-recenter-after-tag-follow     nil
            treemacs-recenter-after-project-jump   'always
            treemacs-recenter-after-project-expand 'on-distance
            treemacs-show-cursor                   nil
            treemacs-show-hidden-files             nil
            treemacs-silent-filewatch              nil
            treemacs-silent-refresh                nil
            treemacs-sorting                       'alphabetic-asc
            treemacs-space-between-root-nodes      t
            treemacs-tag-follow-cleanup            t
            treemacs-tag-follow-delay              1.5
            treemacs-user-mode-line-format         nil
            treemacs-width                         30)

      ;; The default width and height of the icons is 22 pixels. If you are
      ;; using a Hi-DPI display, uncomment this to double the icon size.
      ;;(treemacs-resize-icons 44)

      (treemacs-follow-mode t)
      (treemacs-filewatch-mode t)
      (treemacs-fringe-indicator-mode t)
      (pcase (cons (not (null (executable-find "git")))
                   (not (null treemacs-python-executable)))
        (`(t . t)
         (treemacs-git-mode 'deferred))
        (`(t . _)
         (treemacs-git-mode 'simple))))
    :bind
    (:map global-map
          ("M-0"       . treemacs-select-window)
          ("C-x t 1"   . treemacs-delete-other-windows)
          ("<f8>"   . treemacs)
          ("C-x t B"   . treemacs-bookmark)
          ("C-x t C-t" . treemacs-find-file)
          ("C-x t M-t" . treemacs-find-tag)))

  (use-package treemacs-evil
    :after treemacs evil
    :ensure t)

  (use-package treemacs-projectile
    :after treemacs projectile
    :ensure t)

  (use-package treemacs-icons-dired
    :after treemacs dired
    :ensure t
    :config (treemacs-icons-dired-mode))

  (use-package treemacs-magit
    :after treemacs magit
    :ensure t)

  (use-package treemacs-persp
    :after treemacs persp-mode
    :ensure t
    :config (treemacs-set-scope-type 'Perspectives))
  (add-to-list 'default-frame-alist '(fullscreen . fullboth))
#+END_SRC

#+RESULTS:
: ((fullscreen . fullboth) (vertical-scroll-bars))

* basic config
#+BEGIN_SRC emacs-lisp
  (dolist
      (key '("\C-b" "\C-o" "\C-p" "\C-q"
             "\C-t" "\C-v" "\C-z"
             ))
    (global-unset-key key))
  (setq home "~/.emacs.d/")
  (global-visual-line-mode 1)
  (set-default-font "Monospace-12")
  ;; 使用y代替yes,n代替no
  (fset 'yes-or-no-p 'y-or-n-p)
  ;; 括号匹配
  (show-paren-mode t)
  ;; 不要菜单栏
  (menu-bar-mode -1)
  ;; 不要工具栏
  (tool-bar-mode -1)
  ;; 不要滚动条
  (if (boundp 'x-toolkit-scroll-bars)
      (scroll-bar-mode -1))
  ;; 状态栏显示时间
  (display-time-mode t)
  ;;状态栏显示列号
  (column-number-mode t)
  ;; 鼠标遇到光标时弹开
  (mouse-avoidance-mode 'animate)

  ;; 最后一行不要有换行符
  ;(setq-default next-line-add-newlines nil)
  ;(setq mode-require-final-newline nil)

  ;; 终端不响铃
  (setq ring-bell-function 'ignore ;; 终端不响铃
        visible-bell t ;; 状态栏不闪

        user-full-name "LisperInmove" ;; 邮件用户名
        user-mail-address "lisper.inmove@gmail.com" ;; 邮箱

        scroll-margin 3 ;; 屏幕滚动时保留三行
        scroll-conservatively 100000

        make-backup-files nil ;; 关闭自动保存
        auto-save-default nil

        display-time-24hr-format t ;; 24小时
        display-time-day-and-date t)

  (setq-default c-basic-offset 4)
  (setq-default indent-tabs-mode nil)
  ;; 选中行的颜色
  (set-face-attribute 'region nil :background "#666" :foreground "#ffffff")

  ;; 减少gc的次数
  (setq gc-cons-threshold (* 50 1000 1000))

  ;; 保存时删除行尾空格
  (add-hook 'before-save-hook 'delete-trailing-whitespace)
  ;; (add-hook 'before-save-hook 'whitespace-cleanup)
  (defun my-load-file (filename)
    (load-file (expand-file-name (concat home filename))))

  (fset 'delete-empty-lines (kbd "M-x flush-lines RET ^\s-*$ RET"))
#+end_src

#+RESULTS:
: [134217848 102 108 117 115 104 45 108 105 110 101 115 13 94 45 42 36 13]
* less-css-mode
#+BEGIN_SRC emacs-lisp
  (use-package less-css-mode
    :defer 1)
#+END_SRC

#+RESULTS:
: [nil 0 1 0 nil require (less-css-mode nil t) idle 0]
